## Terraform Plan Output - sim - bastion
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.bastion.module.bastion_host["eastus"].azurerm_bastion_host.bastion has been deleted
  - resource "azurerm_bastion_host" "bastion" {
      - copy_paste_enabled     = true -> null
      - dns_name               = "bst-71451865-0049-4490-9f69-27b4b6660c24.bastion.azure.com" -> null
      - file_copy_enabled      = true -> null
      - id                     = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-sim-bastion-eastus-rg/providers/Microsoft.Network/bastionHosts/dbdemo-sim-bastion-eastus-snap" -> null
      - ip_connect_enabled     = false -> null
      - location               = "eastus" -> null
      - name                   = "dbdemo-sim-bastion-eastus-snap" -> null
      - resource_group_name    = "dbdemo-sim-bastion-eastus-rg" -> null
      - scale_units            = 2 -> null
      - shareable_link_enabled = false -> null
      - sku                    = "Standard" -> null
      - tags                   = {
          - "environment" = "sim"
          - "owner"       = "av"
          - "source"      = "terraform"
          - "stack"       = "bastion"
        } -> null
      - tunneling_enabled      = true -> null

      - ip_configuration {
          - name                 = "bastion-eastus-pip" -> null
          - public_ip_address_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-sim-bastion-eastus-rg/providers/Microsoft.Network/publicIPAddresses/dbdemo-sim-bastion-eastus-pip" -> null
          - subnet_id            = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-sim-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-sim-hub-eastus-fw/subnets/AzureBastionSubnet" -> null
        }
    }

  # module.bastion.module.bastion_host["eastus2"].azurerm_bastion_host.bastion has been deleted
  - resource "azurerm_bastion_host" "bastion" {
      - copy_paste_enabled     = true -> null
      - dns_name               = "bst-a5e2095a-37b9-4dfe-8d3d-69e076420653.bastion.azure.com" -> null
      - file_copy_enabled      = true -> null
      - id                     = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-sim-bastion-eastus2-rg/providers/Microsoft.Network/bastionHosts/dbdemo-sim-bastion-eastus2-snap" -> null
      - ip_connect_enabled     = false -> null
      - location               = "eastus2" -> null
      - name                   = "dbdemo-sim-bastion-eastus2-snap" -> null
      - resource_group_name    = "dbdemo-sim-bastion-eastus2-rg" -> null
      - scale_units            = 2 -> null
      - shareable_link_enabled = false -> null
      - sku                    = "Standard" -> null
      - tags                   = {
          - "environment" = "sim"
          - "owner"       = "av"
          - "source"      = "terraform"
          - "stack"       = "bastion"
        } -> null
      - tunneling_enabled      = true -> null

      - ip_configuration {
          - name                 = "bastion-eastus2-pip" -> null
          - public_ip_address_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-sim-bastion-eastus2-rg/providers/Microsoft.Network/publicIPAddresses/dbdemo-sim-bastion-eastus2-pip" -> null
          - subnet_id            = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-sim-hub-eastus2-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-sim-hub-eastus2-fw/subnets/AzureBastionSubnet" -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.bastion.azurerm_public_ip.bastion["eastus"] will be created
  + resource "azurerm_public_ip" "bastion" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "dbdemo-sim-bastion-eastus-pip"
      + public_ip_prefix_id     = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-sim-pips-eastus-rg/providers/Microsoft.Network/publicIPPrefixes/dbdemo-sim-pips-eastus-pippf"
      + resource_group_name     = "dbdemo-sim-bastion-eastus-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.bastion.azurerm_public_ip.bastion["eastus2"] will be created
  + resource "azurerm_public_ip" "bastion" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus2"
      + name                    = "dbdemo-sim-bastion-eastus2-pip"
      + public_ip_prefix_id     = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-sim-pips-eastus2-rg/providers/Microsoft.Network/publicIPPrefixes/dbdemo-sim-pips-eastus2-pippf"
      + resource_group_name     = "dbdemo-sim-bastion-eastus2-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.bastion.azurerm_resource_group.this["eastus"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "dbdemo-sim-bastion-eastus-rg"
      + tags     = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "source"      = "terraform"
          + "stack"       = "bastion"
        }
    }

  # module.bastion.azurerm_resource_group.this["eastus2"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "dbdemo-sim-bastion-eastus2-rg"
      + tags     = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "source"      = "terraform"
          + "stack"       = "bastion"
        }
    }

  # module.bastion.module.bastion_host["eastus"].azurerm_bastion_host.bastion will be created
  + resource "azurerm_bastion_host" "bastion" {
      + copy_paste_enabled     = true
      + dns_name               = (known after apply)
      + file_copy_enabled      = true
      + id                     = (known after apply)
      + ip_connect_enabled     = false
      + location               = "eastus"
      + name                   = "dbdemo-sim-bastion-eastus-snap"
      + resource_group_name    = "dbdemo-sim-bastion-eastus-rg"
      + scale_units            = 2
      + shareable_link_enabled = false
      + sku                    = "Standard"
      + tags                   = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "source"      = "terraform"
          + "stack"       = "bastion"
        }
      + tunneling_enabled      = true

      + ip_configuration {
          + name                 = "bastion-eastus-pip"
          + public_ip_address_id = (known after apply)
          + subnet_id            = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-sim-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-sim-hub-eastus-fw/subnets/AzureBastionSubnet"
        }
    }

  # module.bastion.module.bastion_host["eastus2"].azurerm_bastion_host.bastion will be created
  + resource "azurerm_bastion_host" "bastion" {
      + copy_paste_enabled     = true
      + dns_name               = (known after apply)
      + file_copy_enabled      = true
      + id                     = (known after apply)
      + ip_connect_enabled     = false
      + location               = "eastus2"
      + name                   = "dbdemo-sim-bastion-eastus2-snap"
      + resource_group_name    = "dbdemo-sim-bastion-eastus2-rg"
      + scale_units            = 2
      + shareable_link_enabled = false
      + sku                    = "Standard"
      + tags                   = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "source"      = "terraform"
          + "stack"       = "bastion"
        }
      + tunneling_enabled      = true

      + ip_configuration {
          + name                 = "bastion-eastus2-pip"
          + public_ip_address_id = (known after apply)
          + subnet_id            = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-sim-hub-eastus2-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-sim-hub-eastus2-fw/subnets/AzureBastionSubnet"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```
</details>